In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/marketing_data_cleaned.csv")

In [3]:
df.shape
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,AcceptedCmp2,Response,Complain,Country,Age,Customer_Tenure_Days,Customer_Since_Years,Total_Spend,Total_Purchases,Children
0,342199,1985,Graduation,Together,59011.7,1,0,2012-11-17,3,0,...,0,0,0,Spain,39,589,1.6,69,10,1
1,8075450,1975,Master,Single,1730.0,1,1,2013-04-10,96,0,...,0,0,0,Spain,49,445,1.2,39,3,2
2,13664263,1978,Graduation,Married,98584.6,0,0,2014-01-11,99,920,...,0,0,0,Australia,46,169,0.5,1512,9,0
3,16164787,1976,Graduation,Married,74031.5,1,0,2014-06-18,47,265,...,0,0,0,Spain,48,11,0.0,478,15,1
4,15815139,1981,Graduation,Divorced,52784.2,1,1,2014-05-20,0,30,...,0,0,0,Canada,43,40,0.1,330,8,2

In [4]:
df["High_Income"] = np.where(df["Income"] > 75000, 1, 0)
df[['Income', 'High_Income']].head()

    Income  High_Income
0  59011.7            0
1   1730.0            0
2  98584.6            1
3  74031.5            0
4  52784.2            0

In [5]:
df["Young_Customer"] = np.where(df["Age"] < 30, 1, 0)
df[['Age', 'Young_Customer']].head()

   Age  Young_Customer
0   39               0
1   49               0
2   46               0
3   48               0
4   43               0

In [6]:
df["Family_Customer"] = np.where(df["Children"] > 0, 1, 0)
df[['Children', 'Family_Customer']].head()

   Children  Family_Customer
0         1                1
1         2                1
2         0                0
3         1                1
4         2                1

In [7]:
df["Campaign_Responder"] = np.where(df["Response"] == 1, 1, 0)
df[['Response', 'Campaign_Responder']].head()

   Response  Campaign_Responder
0         0                   0
1         0                   0
2         0                   0
3         0                   0
4         0                   0

In [8]:
df["High_Web_Engagement"] = np.where(
    df["NumWebVisitsMonth"] > 5, 1, 0
)
df[['NumWebVisitsMonth', 'High_Web_Engagement']].head()

   NumWebVisitsMonth  High_Web_Engagement
0                  4                    0
1                  3                    0
2                  3                    0
3                  4                    0
4                  6                    1

In [9]:
spend_threshold = df["Total_Spend"].quantile(0.90)

df["High_Spender"] = np.where(
    df["Total_Spend"] > spend_threshold, 1, 0
)
df[['Total_Spend', 'High_Spender']].head()

   Total_Spend  High_Spender
0           69             0
1           39             0
2         1512             0
3          478             0
4          330             0

In [10]:
df["Age_Band"] = pd.cut(
    df["Age"],
    bins=[18, 30, 45, 60, 100],
    labels=["18-29", "30-44", "45-59", "60+"]
)
df[['Age', 'Age_Band']].head()

   Age Age_Band
0   39    30-44
1   49    45-59
2   46    45-59
3   48    45-59
4   43    30-44

In [11]:
df["Income_Band"] = pd.cut(
    df["Income"],
    bins=[0, 30000, 60000, 90000, np.inf],
    labels=["Low", "Medium", "High", "Very High"]
)
df[['Income', 'Income_Band']].head()

    Income Income_Band
0  59011.7      Medium
1   1730.0         Low
2  98584.6   Very High
3  74031.5        High
4  52784.2      Medium

In [12]:
df[
    [
        "High_Income",
        "Young_Customer",
        "Family_Customer",
        "Campaign_Responder",
        "High_Web_Engagement",
        "High_Spender"
    ]
].mean().round(2)

High_Income            0.35
Young_Customer         0.02
Family_Customer        0.68
Campaign_Responder     0.15
High_Web_Engagement    0.54
High_Spender           0.10
dtype: float64

In [13]:
output_path = "../data/marketing_data_final.csv"
df.to_csv(output_path, index=False)

output_path

'../data/marketing_data_final.csv'